---
kind: method
id: M:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor
source: html/29b9281e-9e31-98ae-27a9-35e4dd8b99ef.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor Method

Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.

## Syntax (C#)
```csharp
public ClosestPointsPairBetweenTwoCurves()
```